class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 176, 176, 1]
      input_dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Convolution2D
    config:
      W_constraint: null
      W_regularizer: null
      activation: relu
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      bias: true
      border_mode: valid
      dim_ordering: tf
      init: glorot_uniform
      name: convolution2d_1
      nb_col: 16
      nb_filter: 325
      nb_row: 16
      subsample: &id001 !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - [input_1, 0, 0]
    name: convolution2d_1
  - class_name: Convolution2D
    config:
      W_constraint: null
      W_regularizer: null
      activation: relu
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      bias: true
      border_mode: valid
      dim_ordering: tf
      init: glorot_uniform
      name: convolution2d_2
      nb_col: 1
      nb_filter: 325
      nb_row: 1
      subsample: *id001
      trainable: true
    inbound_nodes:
    - - [convolution2d_1, 0, 0]
    name: convolution2d_2
  - class_name: Cropping2D
    config:
      batch_input_shape: !!python/tuple
      - null
      - !!python/object:tensorflow.python.framework.tensor_shape.Dimension {_value: null}
      - !!python/object:tensorflow.python.framework.tensor_shape.Dimension {_value: 154}
      - !!python/object:tensorflow.python.framework.tensor_shape.Dimension {_value: 154}
      - !!python/object:tensorflow.python.framework.tensor_shape.Dimension {_value: 1}
      cropping: !!python/tuple
      - !!python/tuple [11, 11]
      - !!python/tuple [11, 11]
      input_dtype: float32
      name: cropping2d_1
      trainable: true
    inbound_nodes:
    - - [input_1, 0, 0]
    name: cropping2d_1
  - class_name: Convolution2D
    config:
      W_constraint: null
      W_regularizer: null
      activation: linear
      activity_regularizer: null
      b_constraint: null
      b_regularizer: null
      bias: true
      border_mode: valid
      dim_ordering: tf
      init: glorot_uniform
      name: convolution2d_3
      nb_col: 8
      nb_filter: 1
      nb_row: 8
      subsample: *id001
      trainable: true
    inbound_nodes:
    - - [convolution2d_2, 0, 0]
    name: convolution2d_3
  - class_name: Merge
    config:
      arguments: {}
      concat_axis: -1
      dot_axes: -1
      mode: sum
      mode_type: raw
      name: merge_1
      output_mask: null
      output_mask_type: raw
      output_shape: null
      output_shape_type: raw
    inbound_nodes:
    - - [cropping2d_1, 0, 0]
      - [convolution2d_3, 0, 0]
    name: merge_1
  name: model_1
  output_layers:
  - [merge_1, 0, 0]
keras_version: 1.2.2
